tap "aws/tap"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "nshipster/formulae"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Easiest way to build and release mobile apps
brew "fastlane", link: false
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Add GitHub support to git on the command-line
brew "hub"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Conversion library
brew "libiconv"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Open source relational database management system
brew "mysql"
# Compile-time safe Swift dependency injection framework with real code
brew "needle"
# Framework for layout and rendering of i18n text
brew "pango"
# General-purpose scripting language
brew "php"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, …
brew "swiftgen"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Command-line tool for Weaver
brew "weaver"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Terraform
brew "hashicorp/tap/terraform"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community", link: false
# An interactive JavaScript command-line interface to MongoDB
brew "mongodb/brew/mongodb-community-shell"
# Formatting technology for Swift source code
brew "nshipster/formulae/swift-format"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
