getantidote/use-omz kind:defer
ohmyzsh/ohmyzsh kind:defer
ohmyzsh/ohmyzsh path:plugins/fzf kind:defer
ohmyzsh/ohmyzsh path:plugins/colored-man-pages kind:defer
ohmyzsh/ohmyzsh path:plugins/command-not-found kind:defer
ohmyzsh/ohmyzsh path:plugins/git kind:defer
ohmyzsh/ohmyzsh path:plugins/git-extras kind:defer

rupa/z
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-completions kind:defer
zsh-users/zsh-syntax-highlighting kind:defer

romkatv/powerlevel10k
